<a href="https://colab.research.google.com/github/trista-paul/DS-Unit-1-Sprint-5-Data-Storytelling-Blog-Post/blob/master/TristaWeek5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns

In [0]:
#title of film
title = pd.read_table("https://datasets.imdbws.com/title.akas.tsv.gz")
title.dtypes

/usr/local/lib/python3.6/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (7) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

titleId            object
ordering            int64
title              object
region             object
language           object
types              object
attributes         object
isOriginalTitle    object
dtype: object

In [0]:
title.head()
#redundant values, high quantities of NaNs

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,1,Carmencita - spanyol tánc,HU,\N,imdbDisplay,\N,0
1,tt0000001,2,Καρμενσίτα,GR,\N,\N,\N,0
2,tt0000001,3,Карменсита,RU,\N,\N,\N,0
3,tt0000001,4,Carmencita,US,\N,\N,\N,0
4,tt0000001,5,Carmencita,\N,\N,original,\N,1

In [0]:
title.isnull().sum() #...though they aren't encoded properly

titleId             0
ordering            0
title               0
region             55
language            0
types               0
attributes          0
isOriginalTitle     0
dtype: int64

In [0]:
#Cleaning - drop emptiest cols and cols that aren't useful to main df, then filter by original title
#Then rename and reorganize the title id to be compatible with further dfs
title = title.drop(columns= ['types', 'attributes', 'language', 'region', 'ordering'])
title = title[title['isOriginalTitle'] == 1]
title = title.rename(columns = {'titleId':'tconst'})
title = title.reset_index(drop=True)
title.head()

      tconst                   title isOriginalTitle
0  tt0000001              Carmencita               1
1  tt0000002  Le clown et ses chiens               1
2  tt0000003          Pauvre Pierrot               1
3  tt0000004             Un bon bock               1
4  tt0000005        Blacksmith Scene               1

In [0]:
title.shape

(50581, 3)

In [0]:
title = title.replace({r'\N': np.nan}) #oh my god
#titles with missing values are probably too obscure to matter, so I'll drop nan rows
title = title.dropna()
title.shape

(50581, 3)

In [0]:
#Attributes of film
basics = pd.read_table("https://datasets.imdbws.com/title.basics.tsv.gz")
basics.dtypes

/usr/local/lib/python3.6/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (5) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

tconst            object
titleType         object
primaryTitle      object
originalTitle     object
isAdult            int64
startYear         object
endYear           object
runtimeMinutes    object
genres            object
dtype: object

In [0]:
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,\N,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"

In [0]:
basics = basics.replace({r'\N': np.nan})
basics.isnull().sum() #primary and original title aren't needed anyway #I think it's valuable to keep genre

tconst                  0
titleType               0
primaryTitle            6
originalTitle         181
isAdult                 0
startYear          310240
endYear           5558614
runtimeMinutes    3903283
genres             440614
dtype: int64

In [0]:
basics.titleType.value_counts()

tvEpisode       3851608
short            664113
movie            509937
video            221370
tvSeries         159202
tvMovie          126278
tvMiniSeries      24666
videoGame         22868
tvSpecial         15602
tvShort            9018
Name: titleType, dtype: int64

In [0]:
basics = basics.drop(columns=['primaryTitle', 'originalTitle', 'endYear'])
basics = basics[basics['titleType']=='movie']
basics = basics.dropna()
basics.head()

,tconst,titleType,isAdult,startYear,runtimeMinutes,genres
8,tt0000009,movie,0,1894,45,Romance
145,tt0000147,movie,0,1897,20,"Documentary,News,Sport"
571,tt0000574,movie,0,1906,70,"Biography,Crime,Drama"
673,tt0000679,movie,0,1908,120,"Adventure,Fantasy"
1173,tt0001184,movie,0,1910,58,"Adventure,Drama"

In [0]:
#Directors and staff of film
director = pd.read_table("https://datasets.imdbws.com/name.basics.tsv.gz")
director.dtypes

nconst               object
primaryName          object
birthYear            object
deathYear            object
primaryProfession    object
knownForTitles       object
dtype: object

In [0]:
director.head()

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,nm0000001,Fred Astaire,1899,1987,"soundtrack,actor,miscellaneous","tt0072308,tt0050419,tt0053137,tt0043044"
1,nm0000002,Lauren Bacall,1924,2014,"actress,soundtrack","tt0037382,tt0117057,tt0071877,tt0038355"
2,nm0000003,Brigitte Bardot,1934,\N,"actress,soundtrack,producer","tt0057345,tt0049189,tt0059956,tt0054452"
3,nm0000004,John Belushi,1949,1982,"actor,writer,soundtrack","tt0080455,tt0072562,tt0077975,tt0078723"
4,nm0000005,Ingmar Bergman,1918,2007,"writer,director,actor","tt0050976,tt0083922,tt0069467,tt0050986"

In [0]:
director.shape

(9113821, 6)

In [0]:
director = director.replace({r'\N': np.nan})
director.isnull().sum()

nconst                     0
primaryName                0
birthYear            8641098
deathYear            8949865
primaryProfession    1632075
knownForTitles       1210998
dtype: int64

In [0]:
director = director.drop(columns=['primaryProfession', 'deathYear', 'knownForTitles', 'birthYear'])
director = director.rename(columns = {'nconst':'directors'})
director.head()

   directors      primaryName
0  nm0000001     Fred Astaire
1  nm0000002    Lauren Bacall
2  nm0000003  Brigitte Bardot
3  nm0000004     John Belushi
4  nm0000005   Ingmar Bergman

In [0]:
#critical rating of film
review = pd.read_table("https://datasets.imdbws.com/title.ratings.tsv.gz")
review.dtypes

tconst            object
averageRating    float64
numVotes           int64
dtype: object

In [0]:
review.head()

      tconst  averageRating  numVotes
0  tt0000001            5.8      1457
1  tt0000002            6.4       175
2  tt0000002            6.4       175
3  tt0000003            6.5      1066
4  tt0000003            6.5      1066

In [0]:
review = review.replace({r'\N': np.nan})
review.isnull().sum()

tconst           0
averageRating    0
numVotes         0
dtype: int64

In [0]:
#cleaning - drop rows with 1000 or less votes
review = review[review['numVotes']>= 1000]
review = review.reset_index(drop=True)
review.head()

      tconst  averageRating  numVotes
0  tt0000001            5.8      1462
1  tt0000003            6.6      1075
2  tt0000005            6.2      1778
3  tt0000008            5.6      1562
4  tt0000010            6.9      5214

In [0]:
#directors and writers of film by internal id
directorid =  pd.read_table("https://datasets.imdbws.com/title.crew.tsv.gz")
directorid.dtypes

tconst       object
directors    object
writers      object
dtype: object

In [0]:
directorid.head()

      tconst  directors writers
0  tt0000001  nm0005690      \N
1  tt0000002  nm0721526      \N
2  tt0000002  nm0721526      \N
3  tt0000003  nm0721526      \N
4  tt0000003  nm0721526      \N

In [0]:
directorid = directorid.replace({r'\N': np.nan})
directorid.isnull().sum()

tconst             0
directors    2363847
writers      2784225
dtype: int64

In [0]:
#cleaning - drop writers
directorid = directorid.drop(columns='writers').dropna()
directorid.head()

      tconst  directors
0  tt0000001  nm0005690
1  tt0000002  nm0721526
2  tt0000003  nm0721526
3  tt0000004  nm0721526
4  tt0000005  nm0005690

In [0]:
#merging the datasets
tconst = directorid.merge(review, on='tconst', how='inner')
tconst = tconst.merge(title, on='tconst', how='inner')
tconst = tconst.merge(basics, on='tconst', how='inner')
imdb = tconst.merge(director, on='directors', how='inner')
imdb = imdb.drop(columns=['isOriginalTitle','tconst','directors', 'titleType'])
imdb = imdb.rename(columns = {'primaryName':'director'})
imdb = imdb.sort_values('averageRating', ascending=True)
imdb = imdb.drop_duplicates()
imdb.head()

,averageRating,numVotes,title,isAdult,startYear,runtimeMinutes,genres,director
3136,1.3,3212,"Li hai le, wo de guo",0,2018,90,Documentary,Tie Wei
3070,1.5,1859,Namaste England,0,2018,141,"Comedy,Drama,Romance",Vipul Amrutlal Shah
996,1.7,1046,Ring of Terror,0,1961,71,"Drama,Horror",Clark L. Paylow
3124,1.8,6810,A Sniper's War,0,2018,83,Documentary,Olya Schechter
2628,1.9,11570,Going Overboard,0,1989,99,Comedy,Valerie Breiman

In [0]:
imdb.shape

(3179, 8)

In [0]:
imdb = imdb.replace({r'\N': np.nan})
imdb.isnull().sum()

averageRating     0
numVotes          0
title             0
isAdult           0
startYear         0
runtimeMinutes    0
genres            0
director          0
dtype: int64

# **What are the highest and lowest rated genres?**

In [0]:
#What are the highest and lowest rated genres?
genre = imdb[['genres', 'averageRating']]
genre.head()

                    genres  averageRating
3136           Documentary            1.3
3070  Comedy,Drama,Romance            1.5
996           Drama,Horror            1.7
3124           Documentary            1.8
2628                Comedy            1.9

In [0]:
genre.groupby('genres').averageRating.nunique()
#oh no

genres
Action                         6
Action,Adventure               5
Action,Adventure,Animation     4
Action,Adventure,Biography     2
Action,Adventure,Comedy       29
Action,Adventure,Crime         8
Action,Adventure,Drama        21
Action,Adventure,Family        4
Action,Adventure,Fantasy      16
Action,Adventure,Horror        2
Action,Adventure,Mystery       1
Action,Adventure,Romance       2
Action,Adventure,Sci-Fi       14
Action,Adventure,Thriller     13
Action,Adventure,Western       1
Action,Animation,Comedy        3
Action,Animation,Crime         1
Action,Animation,Drama         1
Action,Animation,Fantasy       2
Action,Biography,Crime         1
Action,Biography,Drama         3
Action,Comedy                  9
Action,Comedy,Crime           25
Action,Comedy,Drama           13
Action,Comedy,Family           4
Action,Comedy,Fantasy          5
Action,Comedy,History          1
Action,Comedy,Horror           2
Action,Comedy,Mystery          3
Action,Comedy,Romance          6
                              ..
Fantasy,Sci-Fi,Thriller        1
History,Romance,Western        1
Horror                        38
Horror,Music                   2
Horror,Musical                 1
Horror,Mystery                10
Horror,Mystery,Romance         2
Horror,Mystery,Sci-Fi          3
Horror,Mystery,Thriller       15
Horror,Romance                 1
Horror,Romance,Sci-Fi          1
Horror,Romance,Thriller        1
Horror,Sci-Fi                 30
Horror,Sci-Fi,Thriller         6
Horror,Thriller               25
Musical,Romance                1
Musical,Romance,War            1
Mystery                        2
Mystery,Romance,Thriller       2
Mystery,Thriller               8
Romance                        3
Romance,Sci-Fi                 1
Romance,Thriller               2
Romance,Thriller,Western       1
Romance,Western                4
Sci-Fi                         9
Sci-Fi,Thriller                4
Thriller                      10
Thriller,War                   1
Western                       11
Name: averageRating, Length: 348, dtype: int64

In [0]:
movielist = []
moviemean = []

for genres in ['Horror', 'Action', 'Romance', 'Adventure', 'Animation', 'Biography', 'Comedy', 'Crime', 'Drama',
              'Family', 'Fantasy', 'Sci-Fi', 'Mystery', 'Thriller', 'Western']:
  MoviesInGenre = genre[genre['genres'].str.contains(genres)]
  m = MoviesInGenre.averageRating.mean()
  movielist.append(genres)
  moviemean.append(m)
print(movielist)
print(moviemean)
Combined = pd.Series(data=moviemean, index=movielist).sort_values()
Combined

['Horror', 'Action', 'Romance', 'Adventure', 'Animation', 'Biography', 'Comedy', 'Crime', 'Drama', 'Family', 'Fantasy', 'Sci-Fi', 'Mystery', 'Thriller', 'Western']
[5.739767441860464, 6.140820312499994, 6.730537974683543, 6.299043062200953, 7.196226415094341, 7.25441176470588, 6.395976529756907, 6.610141987829615, 6.959988214496166, 6.373988439306356, 6.14655172413793, 5.632863849765261, 6.650253807106594, 6.321590909090902, 6.830434782608696]

Sci-Fi       5.632864
Horror       5.739767
Action       6.140820
Fantasy      6.146552
Adventure    6.299043
Thriller     6.321591
Family       6.373988
Comedy       6.395977
Crime        6.610142
Mystery      6.650254
Romance      6.730538
Western      6.830435
Drama        6.959988
Animation    7.196226
Biography    7.254412
dtype: float64

In [0]:
#The 5 lowest rated genres
Combined.head()

Sci-Fi       5.632864
Horror       5.739767
Action       6.140820
Fantasy      6.146552
Adventure    6.299043
dtype: float64

In [0]:
#The 5 highest rated genres
Combined.tail()

Romance      6.730538
Western      6.830435
Drama        6.959988
Animation    7.196226
Biography    7.254412
dtype: float64

# **Who are the highest and lowest rated directors?**

In [0]:
#Who are the highest and lowest rated directors?
directors = imdb[['director', 'averageRating']]
directors.head()
directorCount = directors.director.value_counts()
#lots of directors with only 1 film with more than 1000 votes *cries in Errol Morris*
MoreThan5 = directorCount[directorCount.values >= 5]
MoreThan5 = MoreThan5.index.tolist()
#our conditional list - theatre films with more than 1000 votes from directors with 5 or more other movies with 1000 votes
directors = directors[directors.director.isin(MoreThan5)]
directors.head()

            director  averageRating
198     Roger Corman            2.9
199     Roger Corman            3.1
2137     Albert Pyun            3.1
363   Bert I. Gordon            3.4
203     Roger Corman            3.4

In [0]:
DirectorRating = directors.groupby(directors['director']).mean()
#DirectorRating = DirectorRating.sort_values(by = DirectorRating.averageRating )
type(DirectorRating) #dataframe
DirectorRating.reset_index()
DirectorRating = DirectorRating.sort_values(by = ['averageRating'])
#The Absolute Worst
DirectorRating.head()

                 averageRating
director
Bert I. Gordon        4.140000
Albert Pyun           5.214286
Bob Clark             5.300000
Sam Firstenberg       5.383333
Mark L. Lester        5.633333

In [0]:
#The Best
DirectorRating.tail()

                  averageRating
director
Yasujirô Ozu           8.085714
Akira Kurosawa         8.085714
Stanley Kubrick        8.120000
Satyajit Ray           8.166667
Masaki Kobayashi       8.520000

In [0]:
#how does runtime effect rating?

In [0]:
#do adult films have a different rating trend than non-adult films?

In [0]:
#What were the best and worst decades for film? *cries in 2018*